package ru.aldonin.test.utilities;

public class Announcer {

    public static void sayHello() {
        System.out.println("Вас приветствует Калькулятор!\n" +
                "Введите необходимые данные для вычисления в следующем формате:\n" +
                "[Аргумент1]  [Знак математической операции]  [Аргумент 2]\n" +
                "Для вычисления допустимы только арабские или только римские цифры от 1 до 10 включительно.\n" +
                "1, 2,.. 10\n" +
                "I, II,.. X\n" +
                "Ввод чисел разного формата недопустим.\n" +
                "Допустимые знаки математических операций:\n" +
                "Сложение: «+»\n" +
                "Вычитание: «-»\n" +
                "Умножение: «*»\n" +
                "Деление: «/»\n" +
                "Данные вводятся через пробел.\n");
    }

    public static void sayBye() {
        System.out.println("Работа программы завершена");
    }
    public static void declareResult() {
        System.out.print("Полученный результат: ");
    }
}
